<!doctype html>
  <html>
  <head>
  <meta charset="utf-8">
    <title>建立資料連接</title>
    </head>
    <body>
    <?php
  // 1. 連結資料庫

  $link = mysqli_connect("localhost", "06171014", "06171014", "06171014") or die("無法建立資料連接");

  
  // 建立資料表
  $str = "CREATE TABLE tb_account(";
  $str = $str."id int NOT NULL AUTO_INCREMENT PRIMARY KEY,";
  $str = $str."username VARCHAR(10),";
  $str = $str."passwd VARCHAR(20));";
  
  echo $str."<br>";
  
  $result = mysqli_query($link, $str);
  
  echo "資料表建立成功"."<br>";
  // 新增資料
  $str = "INSERT INTO tb_account (username, passwd) VALUES ";
  $user1 = "('06170020','06170020')";
  $user2 = ",('06170045','06170045')";
  $user3 = ",('06170063','06170063')";
  $user4 = ",('06170072','06170072')";
  $user5 = ",('06170161','06170161')";
  $user6 = ",('06170186','06170186')";
  $user7 = ",('06170195','06170195')";
  $user8 = ",('06170223','06170223')";
  $user9 = ",('06170266','06170266')";
  $user10 = ",('06170293','06170293')";
  $user11 = ",('06170303','06170303')";
  $user12 = ",('06170382','06170382')";
  $user13 = ",('06170401','06170401')";
  $user14 = ",('06170426','06170426')";
  $user15 = ",('06170435','06170435')";
  $user16 = ",('06170462','06170462')";
  $user17 = ",('06170524','06170524')";
  $user18 = ",('06170560','06170560')";
  $user19 = ",('06170585','06170585')";
  $user20 = ",('06170604','06170604')";
  $user21 = ",('06170622','06170622')";
  $user22 = ",('06170665','06170665')";
  $user23 = ",('06170702','06170702')";
  $user24 = ",('06170745','06170705')";
  $user25 = ",('06170763','06170763')";
  $user26 = ",('06170772','06170772')";
  $user27 = ",('06170781','06170781')";
  $user28 = ",('06170790','06170790')";
  $user29 = ",('06170816','06170816')";
  $user30 = ",('06170861','06170861')";
  $user31 = ",('06170914','06170914')";
  $user32 = ",('06170923','06170923')";
  $user33 = ",('06170941','06170941')";
  $user34 = ",('06171014','06171014')";
  $user35 = ",('06171023','06171023')";
  $user36 = ",('06171050','06171050')";
  $user37 = ",('06171093','06171093')";
  $user38 = ",('06171103','06171103')";
  $user39 = ",('06171121','06171121')";
  $user40 = ",('06171146','06171146')";
  $user41 = ",('06171191','06171191')";
  $user42 = ",('06173022','06173022')";
  $user43 = ",('06173065','06173065')";
  $user44 = ",('06170640','06170640')";
  $user45 = ",('06173083','06173083');";
  
  $str = $str.$user1.$user2.$user3.$user4.$user5.$user6.$user7.$user8.$user9.$str10.$user11.$user12.$user13.$user14.$user15.$user16.$user17.$user18.$user19.$str20.$user21.$user22.$user23.$user24.$user25.$user26.$user27.$user28.$user29.$str30.$user31.$user32.$user33.$user34.$user35.$user36.$user37.$user38.$user39.$str40.$user41.$user42.$user43.$user44.$user45;
  
  echo $str."<br>";
  
  // 4. 使用函數查詢
  $result = mysqli_query($link, $str);
  echo "帳密建立完畢"."<br>";;
  
  // 6. 釋放記憶體
  mysqli_free_result($result);
  
  
  
  // 7. 關閉資料庫
  mysqli_close($link);
  
  
  ?> 
    </body>
    </html>
    
    